//プログラムヘッダ*****************************************************************
//	プログラム概要	:	ゲーム用ウィンドウ クラス定義
//*********************************************************************************
#pragma once

//==include部======================================================================
#include "../System/GameManager.h"
#include "Window.h"
//=================================================================================


//==定数・列挙型宣言部=============================================================
#define SCREEN_WIDTH	800					// スクリーンの幅
#define SCREEN_HEIGHT	500					// スクリーンの高さ
#define CAPTION_NAME	_T("タイトル")		// キャプション名

#define FRAME_RATE		(1000/60)			// フレームレート
//=================================================================================


//==マクロ定義部===================================================================

//=================================================================================


//==クラス・構造体宣言部===========================================================
class CGameWindow : public CWindow
{
private:
	CGameManager*	m_pGameManager;	// ゲーム管理

	bool		m_bWindow;			// ウィンドウ / フルスクリーン

	DWORD		m_dwExecLastTime;	// FPS計測用
	DWORD		m_dwFPSLastTime;	// FPS計測、前回更新時間
	DWORD		m_dwFrameCount;		// フレーム数カウンタ

public:
	bool InitInstance();
	int ExitInstance();

	bool OnIdle(long lCount);		// アイドル時処理

	LRESULT WndProc(UINT uMsg, WPARAM wParam, LPARAM lParam);	// プロシージャ実装部分
};
//=================================================================================

//=================================================================================
//	End of File
//=================================================================================