//プログラムヘッダ*****************************************************************
//	プログラム概要	:	速度計測
//*********************************************************************************
#pragma once

//==include部======================================================================
#include "ObjBase.h"
#include <tchar.h>
//=================================================================================


//==定数・列挙型宣言部=============================================================

//=================================================================================


//==マクロ定義部===================================================================

//=================================================================================


//==クラス・構造体宣言部===========================================================
class CTimeAnalizer : public CObjBase
{
protected:
	TCHAR			m_szMsg[512];

	LARGE_INTEGER	m_nSTime;
	LARGE_INTEGER	m_nETime;

public:
	CTimeAnalizer();
	virtual ~CTimeAnalizer();

	static CTimeAnalizer*	Create(TCHAR* szStr , int nSceneID);
	virtual bool	Init(TCHAR* szStr , int nSceneID);

	virtual void	Draw();
	virtual void	DrawLate();

	virtual void	StartPoint();
	virtual void	EndPoint();

	virtual void Activate(bool bFlg);

	void SetMsg(TCHAR* str);
};
//=================================================================================


//=================================================================================
//	End of File
//=================================================================================