//プログラムヘッダ*****************************************************************
//	プログラム概要	:	シーン変更中クラス定義
//*********************************************************************************
#pragma once

//==include部======================================================================
#include "../System/common.h"
#include "..\Scene\Scene.h"

//=================================================================================


//==定数・列挙型宣言部=============================================================
namespace eChanging
{
	enum
	{
		CHANGE_NONE,					// 即時切替

		CHANGE_WHITEFEAD,				// 白フェード
		CHANGE_BLACKFEAD,				// 黒フェード

		CHANGE_MAX
	};
};

// プライオリティ

//=================================================================================


//==マクロ定義部===================================================================
//=================================================================================


//==クラス宣言部===================================================================
class CChanging : public CScene
{
private:
	//-------- ゲーム用オブジェクト
	bool	m_bChange;								// チェンジ中フラグ
	bool	m_bBefore;								// 前シーン変更中フラグ

	int		m_nChangeType;
	CScene*	m_pBefore;								// 前シーン
	CScene*	m_pAfter;								// 次シーン

	S_HANDLE	m_hChangeObj;						// 変更処理を行うオブジェクト

public:
	CChanging();
	virtual ~CChanging();

	static CChanging* Create(int nSceneID);			// 生成
	virtual void Release();							// 解放

	virtual bool Init();							// ループ内初期化
	virtual void Uninit();							// ループ内終了処理

	virtual void Input();							// 入力受付
	virtual void Update();							// 更新
	
	virtual void SceneChange();						// シーン変更
	virtual	void ChangeEnd();						// シーンチェンジ終了

	virtual void Draw();							// 描画
	

	// --ゲット・セット--
	virtual	int		GetMaxPriority();

	bool	SetNextScene(CScene* pNext , CScene* pCurrent , int nChangeType);

	bool	GetChangeFlg(){return m_bChange;}		// チェンジ中フラグ取得
	CScene*	GetAfterScene(){return m_pAfter;}		// 変更後シーン取得

private:
};
//=================================================================================


//==プロトタイプ宣言===============================================================
//=================================================================================

//=================================================================================
//	End of File
//=================================================================================