//プログラムヘッダ*****************************************************************
//	プログラム概要	:	リソースロード
//*********************************************************************************
#pragma once

//==include部======================================================================
#include "../System/common.h"
#include "Scene.h"
//=================================================================================


//==定数・列挙型宣言部=============================================================
// プライオリティ
namespace eResLoadScenePri
{
	enum 
	{	
		NONE,
		BG,

		OBJ,

		FEAD,

		MAX
	};
};
//=================================================================================


//==マクロ定義部===================================================================

//=================================================================================


//==クラス・構造体宣言部===========================================================
class CResLoadScene : public CScene
{
protected:
	//-------- ゲーム用オブジェクト
	int			m_nWaitCnt;
	S_HANDLE	m_hFead;
	HANDLE		m_hThread;							// スレッドのハンドル

	static unsigned int WINAPI ResLoading(void* arg);		// リソースロード関数
	bool		m_bChangeFlg;

public:
	CResLoadScene();
	virtual ~CResLoadScene();

	static CResLoadScene* Create(int nSceneID);		// 生成
	
	virtual bool Init();							// ループ内初期化
	virtual void Uninit();							// ループ内終了処理
	
	virtual void Update();							// 更新
	

	// --ゲット・セット--
	virtual	int		GetMaxPriority();

private:

};
//=================================================================================


//=================================================================================
//	End of File
//=================================================================================